app/Http/Controllers/WoodFenceController.php

SELECT `family_category_id`, `family_category_name`, `category_description` FROM `family_categories` WHERE `parent_category_id` = 16
SELECT * FROM `family_categories` WHERE `parent_category_id` = 16 and `family_category_id` not in (16)
SELECT `image` FROM `general_media` WHERE `family_category_id` = 16 LIMIT 1
SELECT `family_category_id` FROM `family_categories` WHERE `parent_category_id` = '19'
SELECT distinct `spacing` FROM `product_details` WHERE `family_category_id` = 17 and `spacing` IS not NULL
---
    public function index()
    {
        // Fetch Wood Fence Subcategories
        $woodFenceSubcategories = DB::table('family_categories')
            ->where('parent_category_id', 16) // Wood Fence parent category
            ->select('family_category_id', 'family_category_name', 'category_description')
            ->get();

        $subcategoriesWithSpacing = [];
        foreach ($woodFenceSubcategories as $subcategory) {
            $image = DB::table('general_media')
                ->where('family_category_id', $subcategory->family_category_id)
                ->value('image');

            $spacingOptions = DB::table('product_details')
                ->where('family_category_id', $subcategory->family_category_id)
                ->whereNotNull('spacing')
                ->distinct()
                ->pluck('spacing');

SELECT `products`.*, `product_details`.*, `product_media`.`general_image` as `image` FROM `products` inner join `product_details` on `products`.`product_id` = `product_details`.`product_id` inner join `product_media` on `products`.`product_id` = `product_media`.`product_id` WHERE `products`.`subcategory_id` in (178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 318, 322) and `product_details`.`spacing` = '1 3/4 in.' and `product_details`.`style` = 'Straight on Top' and `product_details`.`speciality` in ('Slant Ear', 'Gothic Point', 'French Gothic')
---
    public function getProductsGroupedByStyle($subcategoryId, $spacing, $showAll = false)
    {
       $formattedSpacing = str_replace('_', ' ', $spacing);
       $defaultPicketStyles = ['Slant Ear', 'Gothic Point', 'French Gothic'];

       $validCombos = DB::table('products')
           ->join('product_details', 'products.product_id', '=', 'product_details.product_id')
           ->select('style', 'speciality')
           ->where([
               ['subcategory_id', $subcategoryId],
               ['spacing', $formattedSpacing]
           ]);

       if (!$showAll) {
           $validCombos->whereIn('speciality', $defaultPicketStyles);
       }

       $validCombos = $validCombos->distinct()->get();

       $styleGroups = [];
       foreach ($validCombos->groupBy('style') as $style => $combos) {
           $styleProducts = [];
           foreach ($combos as $combo) {
               $product = DB::table('products')
                   ->join('product_details', 'products.product_id', '=', 'product_details.product_id')
                   ->join('product_media', 'products.product_id', '=', 'product_media.product_id')
                   ->where([
                       ['products.subcategory_id', $subcategoryId],
                       ['product_details.spacing', $formattedSpacing],
                       ['product_details.style', $combo->style],
                       ['product_details.speciality', $combo->speciality]
                   ])
                   ->first();